In [43]:
# Dependencies
import pandas as pd

In [2]:
# Save path to data set in a variable
data_file = "Resources/dataSet.csv"

In [18]:
# Use Pandas to read data
data_file_df = pd.read_csv(data_file)
data_file_df.head(20)

    id First Name  Last Name Gender   Amount
0    1       Todd      Lopez      M   8067.7
1    2     Joshua      White      M   7330.1
2    3       Mary      Lewis      F  16335.0
3    4      Emily      Burns      F  12460.8
4    5  Christina     Romero      F  15271.9
5    6    Raymond    Andrews      M   7036.9
6    7     Sandra      Baker      F  14002.2
7    8       Todd       Diaz      M  10911.0
8    9      Alice      Burke      F  14198.8
9   10      Wayne   Richards      M  16410.5
10  11      Brian     Hansen      M  15029.4
11  12     Johnny     Tucker      M  16205.6
12  13     Ronald    Wheeler      M     57.9
13  14       John     Turner      M  19909.3
14  15     Steven   Reynolds      M  11316.5
15  16     Pamela  Carpenter      F   5170.4
16  17    Stephen      Scott      M  16331.1
17  18      Larry       Ryan      M  18337.8
18  19    Jeffrey   Marshall      M  19482.5
19  20      Betty  Fernandez      F  16394.4

In [4]:
# Display a statistical overview of the DataFrame
data_file_df.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000  10051.323600
std     288.819436   5831.230806
min       1.000000      3.400000
25%     250.750000   4854.875000
50%     500.500000  10318.050000
75%     750.250000  15117.425000
max    1000.000000  19987.400000

In [31]:
# Reference a single column within a DataFrame
data_file_df['First Name'].head()

0         Todd
1       Joshua
2         Mary
3        Emily
4    Christina
Name: First Name, dtype: object

In [30]:
# Reference multiple columns within a DataFrame


data_file_df[["First Name", "Last Name", "Amount"]].head()

  First Name Last Name   Amount
0       Todd     Lopez   8067.7
1     Joshua     White   7330.1
2       Mary     Lewis  16335.0
3      Emily     Burns  12460.8
4  Christina    Romero  15271.9

In [33]:
# The mean method averages the series
average = data_file_df["Amount"].mean()
average

10051.323600000002

In [35]:
# The sum method adds every entry in the series
total = data_file_df["Amount"].sum()
total

10051323.600000001

In [37]:
# The unique method shows every element of the series that appears only once
unique = data_file_df["Last Name"].unique()
unique

242

In [40]:
# The value_counts method counts unique values in a column
count = data_file_df["Gender"].value_counts()
count

M    515
F    485
Name: Gender, dtype: int64

In [42]:
# Calculations can also be performed on Series and added into DataFrames as new columns
thousands_of_dollars = data_file_df["Amount"]/1000
data_file_df["Thousands of Dollars"] = thousands_of_dollars

data_file_df.head()

   id First Name Last Name Gender   Amount  Thousands of Dollars
0   1       Todd     Lopez      M   8067.7                8.0677
1   2     Joshua     White      M   7330.1                7.3301
2   3       Mary     Lewis      F  16335.0               16.3350
3   4      Emily     Burns      F  12460.8               12.4608
4   5  Christina    Romero      F  15271.9               15.2719